TOKEN = "5434216581:AAECGFCbjGWULyI2PKMDkhtpXBCh-UGQpRM"

AdminTelegramID = 1106840591

owners_profile = "@SamsonovEugene"

director_name = "Бабатова Аида Нуцаловна"

helloWords = [
    "привет",
    "дарова",
    "даров",
    "здаров",
    "здравствуйте",
    "добрый вечер",
    "доброе утро",
    "добрый день",
]

helpWords = [
    "помоги",
    "помоги мне",
    "мне нужна помощь",
    "помощь",
]

thanksWords = [
    "спасибо",
    "спасибочки",
    "пасиба",
    "пасиб",
]

diary_words = [
    "дневник",
    "покажи дневник",
    "покажи мой дневник",
    "покажи мне дневник",
    "дневничок",
    "покажи дневничок",
    "покажи мой дневничок",
    "покажи мне дневничок",
]

TimelineWords = [
    "какое расписание звонков",
    "какое расписание звонков?",
    "скажи расписание звонков",
    "расписание звонков",
]

lessonScheduleWordsFor11_2 = [
    "какое расписание уроков 11 2",
    "какое расписание уроков 11 2?",
    "скажи расписание уроков 11 2",

    "какое расписание уроков у 11 2",
    "какое расписание уроков у 11 2?",
    "скажи расписание уроков у 11 2",

    "расписание уроков 11 2",
    "расписание уроков у 11 2",

    "уроки у 11 2",
    "уроки 11 2",

    "расписание 11 2",

    "какое расписание уроков одиннадцатого второго",
    "какое расписание уроков одиннадцатого второго?",
    "скажи расписание уроков одиннадцатого второго",

    "какое расписание уроков у одиннадцатого второго",
    "какое расписание уроков у одиннадцатого второго?",
    "скажи расписание уроков у одиннадцатого второго",

    "расписание уроков одиннадцатого второго",
    "расписание уроков у одиннадцатого второго",

    "уроки у одиннадцатого второго",
    "уроки одиннадцатого второго",

    "расписание одиннадцатого второго"
]

lessonScheduleWordsFor11_1 = [
    "какое расписание уроков 11 1",
    "какое расписание уроков 11 1?",
    "скажи расписание уроков 11 1",

    "какое расписание уроков у 11 1",
    "какое расписание уроков у 11 1?",
    "скажи расписание уроков у 11 1",

    "расписание уроков 11 1",
    "расписание уроков у 11 1",

    "уроки у 11 1",
    "уроки 11 1",

    "расписание 11 1",

    "какое расписание уроков одиннадцатого первого",
    "какое расписание уроков одиннадцатого первого?",
    "скажи расписание уроков одиннадцатого первого",

    "какое расписание уроков у одиннадцатого первого",
    "какое расписание уроков у одиннадцатого первого?",
    "скажи расписание уроков у одиннадцатого первого",

    "расписание уроков одиннадцатого первого",
    "расписание уроков у одиннадцатого первого",

    "уроки у одиннадцатого первого",
    "уроки одиннадцатого первого",

    "расписание одиннадцатого первого",
]

listOfEGEWords = [
    "расписание егэ",
    "какое расписание егэ",
    "какое расписание егэ?",
    "расписание е",
    "расписание ег",
]

electivesScheduleWords = [
    "какое расписание элективов",
    "какое расписание элективо",
    "какое расписание элективов?",
    "скажи расписание элективов",
    "скажи расписание элективо",
    "расписание элективов",
    "расписание элективо",
]


whatAddressOfSchoolWords = [
    "какой адрес школы?",
    "какой адрес школы",
    "адрес школы"]

whatDirectorNameWords = [
    "как зовут директора школы?",
    "как зовут директора школы",
    "как зовут директора",
    "как зовут директора?",
]

whoDoesntStudyOnSaturday = [
    "кто не учится в субботу?",
    "кто не учится в субботу",
    "кто учится в субботу?",
    "кто учится в субботу",
]

whatPhoneNuberOfSchoolWords = [
    "какой телефон у школы?",
    "какой телефон у школы",
    "телефон школы",
    "школьный телефон",
    "какой номер телефона школы?",
    "какой номер телефона школы",
    "какой номер телефона у школы?",
    "номер телефона школы",
    "школьный номер телефона",
    "какой номер телефона школы?",
    "какой номер телефона школы"]

whoIsYourOwner = [
    "кто твой хозяин?",
    "кто твой хозяин",
    "как зовут твоего хозяина?",
    "как зовут твоего хозяина",
]

listOfEGE = """Расписание проведения ЕГЭ:

26 мая – география, литература, химия
29 мая – русский язык
1 июня – математика базового и профильного уровней
5 июня – история, физика
8 июня – обществознание
13 июня – иностранные языки (английский, французский, немецкий, испанский, китайский) (за исключением раздела «Говорение»), биология
16 июня – иностранные языки (английский, французский, немецкий, испанский, китайский) (раздел «Говорение»)
17 июня – иностранные языки (английский, французский, немецкий, испанский, китайский) (раздел «Говорение»)
19 июня – информатика и информационно-коммуникационные технологии (ИКТ)
20 июня – информатика и информационно-коммуникационные технологии (ИКТ)"""

TimelineForLessons = """
Расписание звонков:

Первая смена:
1 урок - 8:00 - 8:45
2 урок - 8:50 - 9:35
3 урок - 9:40 - 10:25
4 урок - 10:35- 11:20
5 урок - 11:25 - 12:10
6 урок - 12:15 - 13:00

Вторая смена:
1 урок - 13:30 - 14:15
2 урок - 14:20 - 15:05
3 урок - 15:10 - 15:55
4 урок - 16:05- 16:50
5 урок - 16:55 - 17:40
6 урок - 17:45 - 18:30"""

electivesSchedule = """
Расписание элективов:

1. Электив по химии будет во вторник с 13:00 по 15:00 в кабинете хими
2. Электив по истории будет в пятницу с 13:30 по 14:15 в кабинете №4
3. Электив по математике будет в субботу с 12:15 по 13:45 в кабинете №2
4. Электив по русскому языку будет во вторник и субботу с 13:30 по 14:15 в кабинете №4
5. Электив по английскому языку будет в понедельник с 12:15 по 13:00 и с 13:30 по 14:15 в кабинете №4
6. Электив по биологии будет в понедельник с 13:30 по 14:15 в кабинете биологи
7. Электив по обществознанию будет в среду с 13:30 по 14:15 в кабинете №4
8. Электив по обществознанию будет в субботу с 13:30 по 14:15 в кабинете №26"""

lessonScheduleFor11_2 = """
Расписание уроков у 11 2 класса:

Понедельник:
1 урок - Классный час (разговоры о важном)
2 урок - Химия
3 урок - Математика
4 урок - Математика
5 урок - Физкультура
6 урок - История

Вторник:
1 урок - Литература
2 урок - Физкультура
3 урок - История
4 урок - Английский язык
5 урок - Биология
6 урок - Русский язык

Среда:
1 урок - Русский язык
2 урок - Русский как родной
3 урок - Физика
4 урок - Математика
5 урок - Английский язык
6 урок - Математика

Четверг:
1 урок - Обществознание
2 урок - Дагестанская литература
3 урок - Английский язык
4 урок - Математика
5 урок - О.Б.Ж.
6 урок - Литература

Пятница:
1 урок - Химия
2 урок - Физкультура
3 урок - Математика
4 урок - Физика
5 урок - Биология
6 урок - Обществознание

Суббота:
1 урок - Биология
2 урок - Литература
3 урок - Химия
4 урок - Информатика
5 урок - География"""

lessonScheduleFor11_1 = """
Расписание уроков у 11 1 класс

Понедельник:
1 урок - Классный час (разговоры о важном)
2 урок - Английский язык
3 урок - Французкий/Немецкий язык
4 урок - Русский язык
5 урок - История
6 урок - Русский язык

Вторник:
1 урок - Английский язык
2 урок - Общество
3 урок - Литература
4 урок - Математика
5 урок - Русский язык
6 урок - Химия

Среда:
1 урок - Английский язык
2 урок - Физика
3 урок - Русский язык
4 урок - Физкультура
5 урок - Математика
6 урок - Литература

Четверг:
1 урок - Математика
2 урок - Обществознание
3 урок - М.Х.К.
4 урок - О.Б.Ж.
5 урок - Физкультура
6 урок - Английский язык

Пятница:
1 урок - Английский язык
2 урок - История
3 урок - Физика
4 урок - Обществознание
5 урок - Литература
6 урок - Математика

Суббота:
1 урок - Английский язык
2 урок - Физкультура
3 урок - Биология
4 урок - География
5 урок - Дагестанская литература
6 урок - Французкий/Немецкий язык"""
